Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/health/health_services/health_services_for_older_people/moving_from_home_to_long_term_care.html.txt.tmx
Source language: en
Languages: ga

source: Moving from home to long-term care
ga: Ag bogadh ón mbaile go cúram fadtéarmach

source: The issue of moving from home to long stay institutional care usually arises when people are older
ga: De ghnáth éiríonn an cheist maidir le bogadh ón mbaile chuig cúram institiúide fadtéarmach nuair a bhíonn daoine níos sine

source: A small number of younger people may also face the problem of being unable to continue to live at home because of the onset of disability or the progression of a chronic illness
ga: Bíonn sé ina fhadhb freisin do líon beag de dhaoine óga nach féidir leanúint ar aghaidh le maireachtáil sa bhaile mar gheall ar theacht míchumais nó dul chun donais galair ainsealaigh

source: The vast majority of older people are able to live in their own homes with some support from their families, neighbours and the health and community care services
ga: Tá formhór na ndaoine aosta in Éirinn in ann maireachtáil ina mbailte féin le tacaíocht óna dteaghlaigh, a gcomharsana agus na seirbhísí sláinte agus cúram pobail

source: A number of people every year however find they cannot continue to live at home and need to go into long-term care
ga: Gach bliain, áfach, faigheann roinnt daoine amach nach bhfuil siad in ann leanúint ar aghaidh ag maireachtáil sa bhaile agus go dteastaíonn uathu bogadh chuig cúram fadtéarmach

source: Here we outline some information that may help you to continue to live at home or make that transition to long stay care, should it become necessary or desirable
ga: Tugaimid breac-chuntas anseo ar fhaisnéis a bheadh ina cuidiú leat leanúint ar aghaidh ag maireachtáil sa bhaile nó an t-aistriú a dhéanamh chuig cúram fadchónaithe, dá mbeadh sé riachtanach nó inmhianaithe

source: This information is a broad overview of the services and supports available and your entitlements
ga: Is forléargas leathan an fhaisnéis seo ar na seirbhísí agus tacaíochtaí atá ar fáil agus ar do theidlíochtaí

source: More detailed information on these issues is available through the links below
ga: Tá níos mó faisnéise mionsonraithe ar fáil maidir leis na saincheisteanna seo trí na naisc thíos

source: Supports to help you continue to live at home
ga: Tacaíochtaí le cuidiú leat leanúint ar aghaidh ag maireachtáil sa bhaile

source: The Health Service Executive (HSE) provide a range of community care services to enable you to continue to live at home
ga: Soláthraíonn Feidhmeannacht na Seirbhíse Sláinte (FSS) raon de Sheirbhísí Cúram Pobail le cuidiú leat leanúint ar aghaidh ag maireachtáil sa bhaile

source: The help you can get may include home help services, or public health nursing
ga: Féadfar go gcuimseoidh an cúnamh a d’fhéadfadh a bheith ar fáil duit seirbhísí Cúnaimh Baile, nó altranais sláinte poiblí

source: If you need full-time care you may get a Home Care Package from the HSE
ga: Má theastaíonn cúram lánaimseartha uait féadfar go bhfaighidh tú Pacáiste um Chúram Baile ón FSS

source: Your carer may qualify for Carer’s Benefit or Carer’s Allowance and or a Respite Care Grant
ga: Féadfar go mbeidh do chúramóir incháilithe Sochar Cúramóra nó Liúntas Cúramóra a fháil agus/nó Deontas Cúraim Faoisimh

source: If you employ a carer, you may qualify for tax relief to help with the costs
ga: Liúntas Cánach maidir le cúram a thabhairt do dhuine éagumasaithe

source: You may be able to access services provided in day centres
ga: Féadfar go mbeidh tú in ann leas a bhaint as seirbhísí a sholáthraítear in Ionaid Cúram Lae

source: These services may include medical services as well as social and recreational activities
ga: Féadfar go gcuimseoidh na seirbhísí seo seirbhísí míochaine chomh maith le gníomhaíochtaí sóisialta agus caithimh aimsire

source: If you are becoming incapacitated or simply wish to make long-term plans, you may want to consider reading further information on Advance Healthcare Directives and legal arrangements for incapacity
ga: Má tá tú ag éirí éagumasach nó más rud é go bhfuil fonn ort pleananna a dhéanamh don fhadtéarma, b’fhéidir gur chóir duit tuilleadh eolais a léamh maidir le Treoracha um Ardchúram agus Socruithe Dlíthiúla maidir le hÉagumas

source: There are a number of schemes to improve the housing conditions for older people
ga: Soláthraíonn an FSS roinnt deontais freisin faoin scéim um feabhsuithe baile do dhaoine aosta

source: If your home needs to be adapted to enable you to continue to live there, you may qualify for a Housing Adaptation Grant for People with a Disability
ga: De réir teoirice, tá gach duine i dteideal áit a fháil i gcúram fadchónaithe poiblí. De réir cleachtais, níl a ndóthain áiteanna poiblí ar fáil

source: Local authorities have a Housing Aid for Older Persons Scheme which is aimed at improving the condition of an older person's home
ga: Caithfidh gach cónaitheoir a bhfuil áit aige/aici i gcúram fadchónaithe poiblí táillí a íoc as an gcúram fadtéarmach

source: If your own home is unsuitable to continue living there, you may be able to get a specially adapted local authority home for older people and people with disabilities or an adapted home provided by a voluntary housing organisation
ga: Má mheasann an FSS go dteastaíonn leaba i gcúram fadchónaithe poiblí uait nach bhfuil ar fáil, féadfar go ndéanfaidh siad leaba conraithe i dteaghlach altranais príobháideacha a dháileadh duit

source: You may get long-term institutional care in public long-term care facilities or in private nursing homes
ga: Soláthraíonn teaghlaigh altranais príobháideacha cúram fadchónaithe príobháideach

source: Public long stay care is provided in a number of different institutions including HSE nursing homes, geriatric hospitals and community nursing units
ga: Cuirtear cúram fadchónaithe poiblí ar fáil i roinnt institiúidí éagsúla, lena n-áirítear tithe altranais FSS, ospidéil sheanliachta agus aonaid altranais pobail

source: Private long stay care is provided by private nursing homes
ga: Soláthraíonn tithe altranais príobháideacha cúram fadchónaithe príobháideach

source: All nursing homes are regulated by the Health Information and Quality Authority (HIQA)
ga: Tá sé beartaithe an córas monatóireachta agus rialála a athrú trí Údarás um Fhaisnéis agus Cháilíocht Sláinte

source: The Nursing Homes Support Scheme, also known as the “Fair Deal”, provides financial support to people who need long-term nursing home care
ga: Ón 27 Deireadh Fómhair 2009 féadfaidh cónaitheoirí i dtithe altranais príobháideacha agus poiblí araon maoiniú a fháil ón Scéim um Thacaíocht Tithe Banaltrais má shásaíonn siad riachtanais maidir leis an ngá atá acu le cúram cónaitheach agus má shásaíonn siad an measúnú airgeadais

source: There is tax relief on nursing home fees
ga: Má leanann siad ar aghaidh le socrú fóirdheontais i dteach altranais príobháideach d’fhéadfadh siad féin nó cibé duine eile atá ag íoc na dtáillí a bheith incháilithe i gcomhair faoiseamh cánach ar tháillí tithe banaltrais

source: HIQA has a checklist for choosing a nursing home and can help you find a nursing home in your area
ga: Tá seicliosta ag an Údarás um Fhaisnéis agus Cáilíocht Sláinte (HIQA) maidir le teach altranais a roghnú agus is féidir leis cabhrú leat teach altranais a aimsiú i do limistéar

source: There is more information on how to choose a nursing home here
ga: Tá tuilleadh eolais maidir le teach altranais a roghnú ar fáil anseo

source: The HSE operates a scheme of boarding out of older people but it is not widely used
ga: Oibríonn an FSS scéim Lóistín do Dhaoine Aosta ach ní bhaintear mórán úsáide aisti
